---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.Alignment.Name
source: html/d95b019f-4df8-8a25-e66d-c6a9b5f9dd2f.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.Name Property

The Name of this alignment.

## Syntax (C#)
```csharp
public string Name { get; }
```